Documents/ДвижениеОбучающихся.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ДвижениеОбучающихся</Name>
			<BasedOn>
				<xr:Item>Catalog.Обучающиеся</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДвиженияОбучающихся</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебныйГод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Классы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДвиженияОбучающегося</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Литера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Обучающиеся</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отличник</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Класс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Классы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДвиженияОбучающихся.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ДвиженияОбучающихся</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Классы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчебныйГод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГода</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчислен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДвиженияОбучающегося</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Условно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыДвиженияОбучающегося.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыДвиженияОбучающегося</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НовыйУчебныйГод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереходМеждуКлассами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНаОбучение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеОбучения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ДвижениеОбучающихся/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
    Если ТипДокумента = Перечисления.ТипыДвиженияОбучающегося.ПустаяСсылка() Тогда 
		Сообщить("Тип документа - обязательное поле");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если ДатаДействия = '00010101' Тогда
			Сообщить("Дата действия не задана");
			Отказ = Истина;
			Возврат;
	КонецЕсли;

	
	
	
	Движения.ДвиженияОбучающихся.Записывать = Истина;
		
	Для Каждого ТекСтрокаОбучающиеся Из Обучающиеся Цикл   
		Если ТекСтрокаОбучающиеся.ФИО = Справочники.Обучающиеся.ПустаяСсылка() Тогда
			Сообщить("В строке " + ТекСтрокаОбучающиеся.НомерСтроки + " не заполнен обучающийся"); 
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		Движение = Движения.ДвиженияОбучающихся.Добавить();
		Движение.Период = ДатаДействия;
		Движение.Обучающийся = ТекСтрокаОбучающиеся.ФИО;
		Движение.ТипДвижения = ТипДокумента;
		
		Если ТипДокумента = Перечисления.ТипыДвиженияОбучающегося.Отчисление Тогда
			Движение.Класс = Справочники.Классы.ПустаяСсылка();
			Движение.УчебныйГод = Справочники.УчебныеГода.ПустаяСсылка();
			Движение.Комментарий = Комментарий;
			Движение.Отчислен = Истина;
			Движение.Условно = Ложь;
		ИначеЕсли ТипДокумента = Перечисления.ТипыДвиженияОбучающегося.ОкончаниеОбучения Тогда
			Движение.Класс = Справочники.Классы.ПустаяСсылка();
			Движение.УчебныйГод = Справочники.УчебныеГода.ПустаяСсылка();
			Движение.Комментарий = "";
			Движение.Отчислен = Истина;
			Движение.Условно = Ложь;
		Иначе   //Остались прием на обучение и переход между классами
			Если ТекСтрокаОбучающиеся.Класс = Справочники.Классы.ПустаяСсылка() Тогда
				Сообщить("У обучающегося " + ТекСтрокаОбучающиеся.ФИО + " не заполнен класс"); 
				Отказ = Истина;
				Возврат;				
			КонецЕсли;
			Движение.Класс = ТекСтрокаОбучающиеся.Класс;
			Движение.УчебныйГод = УчебныйГод;
			Движение.Комментарий = "";
			Движение.Отчислен = Ложь;
			Движение.Условно = Ложь;
		КонецЕсли;	

	
	КонецЦикла;
	
	
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Обучающиеся") Тогда
		СтрокаОбучающиеся = Обучающиеся.Добавить();
		СтрокаОбучающиеся.ФИО = ДанныеЗаполнения.Ссылка;
		СтрокаОбучающиеся.Отличник = Ложь;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры
